using System;
namespace Mobility {
 public static class Catalog {
 public static readonly int[] Ids = {6,29,30,31,32,33,126,127,128,129,130,131,132,133,134,135};
 public static readonly string[] Names = {"мобильность","адаптируемость","простота установки","сосуществование","взаимозаменяемость","согласованность подсистем","ошибки адаптируемости","несоответствие требованиям по адаптируемости","выявленные ограничения по адаптации на возможных структурах информации для настройки","неоправданно высокие требования к уровню квалификации для установки программного обеспечения","высокая трудоемкость подготовки к установке программного обеспечения","низкий уровень автоматизации установки программного обеспечения","неоправданно высокие затраты времени на установку программного обеспечения","неспособность программного обеспечения работать одновременно с другим независимым программным обеспечением, разделяя общие ресурсы","неспособность программного обеспечения работать вместо другого указанного программного обеспечения в среде заменяемого","несоответствие требованиям стандартов или соглашений, связанных с мобильностью по использованию стандартных протоколов связи"};
 public static readonly string[] FactorNames = {"Опыт разработчиков", "Опыт эксплуатационного персонала", "Трудоёмкость разработки", "Курс рубля к доллару", "Репутация разработчиков", "Репутация эксплуатирующей организации"};
 public static int[,] CreateA() { return new int[,] {
{0,1,1,1,1,1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1},
{0,0,0,0,0,1,-1,-1,-1,0,0,0,0,0,0,0},
{0,1,0,0,0,1,0,0,0,-1,-1,-1,-1,0,0,0},
{0,1,0,0,0,1,0,0,0,0,0,0,0,-1,0,0},
{0,1,1,1,0,1,0,0,0,0,0,0,0,0,-1,0},
{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,-1},
{0,-1,0,0,0,0,0,1,1,0,0,0,0,0,0,0},
{0,-1,0,0,0,-1,0,0,1,0,0,0,0,0,0,0},
{0,-1,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
{0,0,-1,0,0,0,0,0,0,0,0,0,0,0,0,0},
{0,0,-1,0,0,0,0,0,0,1,0,1,0,0,0,0},
{0,0,-1,0,0,0,0,0,0,0,0,0,0,0,0,0},
{0,0,-1,0,0,0,0,0,0,1,1,1,0,0,0,0},
{0,0,0,-1,0,0,0,0,0,0,0,0,0,0,0,0},
{0,0,0,0,-1,0,0,0,0,0,0,0,0,0,0,0},
{0,0,0,0,0,-1,0,0,0,0,0,0,0,0,0,0}}; }
 public static int[,] CreateB() { return new int[,] {
{1,1,-1,0,0,0},
{1,1,-1,0,0,0},
{1,1,-1,0,0,0},
{1,1,-1,0,0,0},
{1,1,-1,0,0,0},
{1,1,-1,0,0,0},
{-1,-1,1,0,0,0},
{-1,-1,1,0,0,0},
{-1,-1,1,0,0,0},
{-1,-1,1,0,0,0},
{-1,-1,1,0,0,0},
{-1,-1,1,0,0,0},
{-1,-1,1,0,0,0},
{-1,-1,1,0,0,0},
{-1,-1,1,0,0,0},
{-1,-1,1,0,0,0}}; }
 }
}
